<!-- 字体图标 rankUp -->
<template>
    <div>
        <svg :width="props.width" :height="props.height" viewBox="0 0 16 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M9.68586 1.44885L15.189 8.91404C15.4588 9.27807 15.5733 9.7342 15.5075 10.1825C15.4416 10.6308 15.2007 11.0347 14.8377 11.3058L14.7762 11.3481C14.4691 11.5609 14.1043 11.6747 13.7307 11.6741H2.7244C2.49175 11.6777 2.26065 11.6355 2.04432 11.5498C1.82798 11.4641 1.63064 11.3367 1.46358 11.1747C1.29651 11.0128 1.16298 10.8195 1.07062 10.6059C0.978261 10.3923 0.928879 10.1627 0.925293 9.93001C0.925128 9.56429 1.04235 9.20816 1.25972 8.91404L6.76285 1.44885C7.05011 1.07474 7.46997 0.825134 7.93586 0.751488C8.40174 0.677843 8.87812 0.785777 9.26677 1.05303C9.42663 1.16185 9.5681 1.29546 9.68586 1.44885Z" fill="#FFC61A"/>
        </svg>
    </div>
</template>


<script setup>
import { defineProps } from 'vue';
 
// 定义props
const props = defineProps({
  width: {
    type: [String, Number],
    default: 16
  },
  height: {
    type: [String, Number],
    default: 12
  }
});
</script>

<style lang="scss" scoped>

</style>



