
<!-- 字体图标 rankUp -->
<template>
    <div>
        <svg :width="props.width" :height="props.height" viewBox="0 0 16 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M6.75428 10.9438L1.25115 3.47655C0.982016 3.11173 0.868535 2.65508 0.93559 2.20673C1.00264 1.75837 1.24476 1.3549 1.60885 1.0848L1.67024 1.04247C1.97753 0.8303 2.34241 0.717291 2.71583 0.718631H13.7221C13.9547 0.71499 14.1858 0.757215 14.4022 0.842896C14.6185 0.928577 14.8158 1.05604 14.9829 1.21799C15.15 1.37995 15.2835 1.57323 15.3759 1.78679C15.4682 2.00036 15.5176 2.23003 15.5212 2.46269C15.522 2.82786 15.4046 3.1835 15.1868 3.47655L9.68364 10.9438C9.3977 11.3221 8.97676 11.5753 8.50864 11.6506C8.04053 11.7259 7.5614 11.6176 7.17125 11.3481C7.0114 11.2367 6.87059 11.1002 6.75428 10.9438Z" fill="#00998A"/>
        </svg>

    </div>
</template>


<script setup>
import { defineProps } from 'vue';
 
// 定义props
const props = defineProps({
  width: {
    type: [String, Number],
    default: 16
  },
  height: {
    type: [String, Number],
    default: 12
  }
});
</script>

<style lang="scss" scoped>

</style>



