<!-- 字体图标 share -->
<template>
    <div>
        <svg :width="props.width" :height="props.height" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M22.9998 10.5C22.9998 9.672 22.3278 9 21.4998 9H12.4998C12.102 9 11.7205 9.15804 11.4392 9.43934C11.1579 9.72064 10.9998 10.1022 10.9998 10.5C10.9998 10.8978 11.1579 11.2794 11.4392 11.5607C11.7205 11.842 12.102 12 12.4998 12H17.9345L9.9745 19.96C9.69319 20.2413 9.53516 20.6228 9.53516 21.0207C9.53516 21.4185 9.69319 21.8 9.9745 22.0813C10.2558 22.3626 10.6373 22.5207 11.0352 22.5207C11.433 22.5207 11.8145 22.3626 12.0958 22.0813L19.9998 14.1773V19.5C19.9998 19.8978 20.1579 20.2794 20.4392 20.5607C20.7205 20.842 21.102 21 21.4998 21C21.8977 21 22.2792 20.842 22.5605 20.5607C22.8418 20.2794 22.9998 19.8978 22.9998 19.5V10.5Z" fill="#FF401A"/>
        </svg>

    </div>
</template>


<script setup>
import { defineProps } from 'vue';
 
// 定义props
const props = defineProps({
  width: {
    type: [String, Number],
    default: 32
  },
  height: {
    type: [String, Number],
    default: 32
  }
});
</script>

<style lang="less" scoped>

</style>

